# Пулим слой с ОСью и удавом с докерхаба (удав у нас 3.9, хотя должно будет пахать 3.7+)
FROM python:3.8-slim-buster

# Копируем из корневой папки настоящего файла, файлик с депенденсями для удава и копируем это в образ в /app/requirements.txt
COPY ./requirements.txt /app/requirements.txt

# меняем рабочую директорию
WORKDIR /app

RUN pip3 install --upgrade pip
# ставим депенденси из файлика
RUN pip install -r requirements.txt

# закхидываем закхидываем ежже все из корня текущей папки в /app 
COPY . /app

# ставим ентрипоинтом (приложением с которого будет запускаться контейнер) удавовский интерпретатор 
ENTRYPOINT [ "python" ]

# скармливаем интерпретатору нашу хуйню
CMD ["app.py"]
